# ImportTooManyElmentsToExplode Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..ImportTooManyElmentsToExplode Property
BuiltInFailures..::..ImportFailures Class See Also
---
Import Instance has [Number] elements. Imports with more than 10,000 elements cannot be exploded.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ImportTooManyElmentsToExplode { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ImportTooManyElmentsToExplode As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ImportTooManyElmentsToExplode {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace